# SQL en Python
<img src=".\img\image-4.png" alt="EDA Path"
    title="A typical EDA path" width="600" height="300" />
## Conectamos con la base de datos

### Documentación de la librería SQLite3 que vamos a utilizar:
https://docs.python.org/3/library/sqlite3.html

In [2]:
# Importamos librerias
import pandas as pd 
import sqlite3

In [3]:
# Conectamos con la base de datos chinook.db
path = "chinook.db"
connection = sqlite3.connect(path)

# Obtenemos un cursor que utilizaremos para hacer las queries. El cursor representa a la base de datos
curs = connection.cursor()

In [4]:
# Creamos una Query sencilla
query = """
SELECT *
FROM genres
"""

In [5]:
# Ejecutamos la query
my_query = curs.execute(query)
my_query

In [6]:
# Pedimos el resultado de la query
my_query.fetchall()

[(1, 'Rock'),
 (2, 'Jazz'),
 (3, 'Metal'),
 (4, 'Alternative & Punk'),
 (5, 'Rock And Roll'),
 (6, 'Blues'),
 (7, 'Latin'),
 (8, 'Reggae'),
 (9, 'Pop'),
 (10, 'Soundtrack'),
 (11, 'Bossa Nova'),
 (12, 'Easy Listening'),
 (13, 'Heavy Metal'),
 (14, 'R&B/Soul'),
 (15, 'Electronica/Dance'),
 (16, 'World'),
 (17, 'Hip Hop/Rap'),
 (18, 'Science Fiction'),
 (19, 'TV Shows'),
 (20, 'Sci Fi & Fantasy'),
 (21, 'Drama'),
 (22, 'Comedy'),
 (23, 'Alternative'),
 (24, 'Classical'),
 (25, 'Opera')]

In [7]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):
    curs.execute(query)
    datos_query = curs.fetchall()
    col_names = [description[0] for description in curs.description]
    return pd.DataFrame(datos_query, columns=col_names)

sql_query(query)

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

In [8]:
# Tambien podemos obtener el mismo resultado directamente con pandas
pd.read_sql_query(query,connection) # connection es la path de la base de datos

    GenreId                Name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll
5         6               Blues
6         7               Latin
7         8              Reggae
8         9                 Pop
9        10          Soundtrack
10       11          Bossa Nova
11       12      Easy Listening
12       13         Heavy Metal
13       14            R&B/Soul
14       15   Electronica/Dance
15       16               World
16       17         Hip Hop/Rap
17       18     Science Fiction
18       19            TV Shows
19       20    Sci Fi & Fantasy
20       21               Drama
21       22              Comedy
22       23         Alternative
23       24           Classical
24       25               Opera

## Ya podemos comenzar con la práctica de chinook:
Antes de empezar a atacar una base de datos, tendremos que saber qué hay dentro, y para ello lo mejor es ver cómo es su **modelo de datos**

![imagen](./img/chinook_data_model.png)

### 1.	Facturas de Clientes de Brasil, Nombre del cliente, Id de factura, fecha de la factura y el país de la factura

In [9]:
query1 = """
SELECT *
FROM invoices i, customers c
WHERE c.CustomerId = i.CustomerId   

"""

In [10]:
# Si las tablas no tienen una key en común no se pueden relacionar directamente. El esquema nos dice que la relación entre estas dos tablas es customersId
# el merge de las tablas solo muestra la intersección de las dos tablas, solo aparecen los elementos comunes (el where sería un inner join)
# si una columna esta en las dos tablas para especificar que columna quiero tendria que decir invoices.FirstName por ejemplo
query1 = """
SELECT invoices.*, FirstName
FROM invoices, customers
WHERE customers.CustomerId = invoices.CustomerId AND customers.Country = "Brazil"
"""

In [11]:
# Otra forma de hacerlo:
query= """
SELECT c.FirstName||" "||c.LastName as "Full Name", i.InvoiceId, i.InvoiceDate, i.BillingCountry
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE c.Country = "Brazil"
"""

pd.read_sql_query(query,connection)

          Full Name  InvoiceId          InvoiceDate BillingCountry
0    Luís Gonçalves         98  2010-03-11 00:00:00         Brazil
1    Luís Gonçalves        121  2010-06-13 00:00:00         Brazil
2    Luís Gonçalves        143  2010-09-15 00:00:00         Brazil
3    Luís Gonçalves        195  2011-05-06 00:00:00         Brazil
4    Luís Gonçalves        316  2012-10-27 00:00:00         Brazil
5    Luís Gonçalves        327  2012-12-07 00:00:00         Brazil
6    Luís Gonçalves        382  2013-08-07 00:00:00         Brazil
7   Eduardo Martins         25  2009-04-09 00:00:00         Brazil
8   Eduardo Martins        154  2010-11-14 00:00:00         Brazil
9   Eduardo Martins        177  2011-02-16 00:00:00         Brazil
10  Eduardo Martins        199  2011-05-21 00:00:00         Brazil
11  Eduardo Martins        251  2012-01-09 00:00:00         Brazil
12  Eduardo Martins        372  2013-07-02 00:00:00         Brazil
13  Eduardo Martins        383  2013-08-12 00:00:00         Brazil
14  Alexandre Rocha         57  2009-09-06 00:00:00         Brazil
15  Alexandre Rocha         68  2009-10-17 00:00:00         Brazil
16  Alexandre Rocha        123  2010-06-17 00:00:00         Brazil
17  Alexandre Rocha        252  2012-01-22 00:00:00         Brazil
18  Alexandre Rocha        275  2012-04-25 00:00:00         Brazil
19  Alexandre Rocha        297  2012-07-28 00:00:00         Brazil
20  Alexandre Rocha        349  2013-03-18 00:00:00         Brazil
21  Roberto Almeida         34  2009-05-23 00:00:00         Brazil
22  Roberto Almeida        155  2010-11-14 00:00:00         Brazil
23  Roberto Almeida        166  2010-12-25 00:00:00         Brazil
24  Roberto Almeida        221  2011-08-25 00:00:00         Brazil
25  Roberto Almeida        350  2013-03-31 00:00:00         Brazil
26  Roberto Almeida        373  2013-07-03 00:00:00         Brazil
27  Roberto Almeida        395  2013-10-05 00:00:00         Brazil
28   Fernanda Ramos         35  2009-06-05 00:00:00         Brazil
29   Fernanda Ramos         58  2009-09-07 00:00:00         Brazil
30   Fernanda Ramos         80  2009-12-10 00:00:00         Brazil
31   Fernanda Ramos        132  2010-07-31 00:00:00         Brazil
32   Fernanda Ramos        253  2012-01-22 00:00:00         Brazil
33   Fernanda Ramos        264  2012-03-03 00:00:00         Brazil
34   Fernanda Ramos        319  2012-11-01 00:00:00         Brazil

### 2.	Facturas de Clientes de Brasil

In [12]:
query2 = """
SELECT i.*
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE c.Country = "Brazil"
"""

pd.read_sql_query(query2,connection).head()
# Pongo head() aqui simplemente para que la tabla no sea tan larga al hacer los ejercicios

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98

### 3.	Muestra cada factura asociada a cada agente de ventas con su nombre completo.

In [13]:
query3="""
SELECT i.*, e.FirstName||" "||e.LastName as "Full Name"
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
"""

pd.read_sql_query(query3,connection)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total,Full Name
0,98,1,2010-03-11 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.98,Jane Peacock
1,121,1,2010-06-13 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,3.96,Jane Peacock
2,143,1,2010-09-15 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,5.94,Jane Peacock
3,195,1,2011-05-06 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,0.99,Jane Peacock
4,316,1,2012-10-27 00:00:00,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,1.98,Jane Peacock
...,...,...,...,...,...,...,...,...,...,...
407,88,57,2010-01-13 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,17.91,Steve Johnson
408,217,57,2011-08-20 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,1.98,Steve Johnson
409,240,57,2011-11-22 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,3.96,Steve Johnson
410,262,57,2012-02-24 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,5.94,Steve Johnson
411,314,57,2012-10-14 00:00:00,"Calle Lira, 198",Santiago,None,Chile,None,0.99,Steve Johnson

### 4.	Para cada factura muestra el nombre del cliente, el país, el nombre del agente y el total

In [14]:
# Siempre es más facil empezar por una tabla de los extremos
query4= """
SELECT c.FirstName||" "||c.LastName as "Full Name", c.Country, e.FirstName||" "||e.LastName as "Employee", i.Total
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
"""

pd.read_sql_query(query4,connection).head(2)

        Full Name Country      Employee  Total
0  Luís Gonçalves  Brazil  Jane Peacock   3.98
1  Luís Gonçalves  Brazil  Jane Peacock   3.96

### 5.	Muestra cada artículo de la factura con el nombre de la canción.

In [15]:
query5 ="""
SELECT i.*, t.Name
FROM tracks t
JOIN invoice_items ii ON t.TrackId = ii.TrackId
JOIN invoices i ON ii.InvoiceId = i.InvoiceId
"""

pd.read_sql_query(query5,connection).head(2)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total,Name
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98,Balls to the Wall
1,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98,Restless and Wild

### 6.	Muestra todas las canciones con su nombre, formato, álbum y género.

In [16]:
# Es importante dar nombres a los select para ver que estamos mostrando
query6 = """
SELECT t.Name as "Song Name", m.Name as "Format", a.Title as "Album", g.Name as "Genre"
FROM tracks t
JOIN genres g ON t.GenreId = g.GenreId
JOIN albums a ON t.AlbumId = a.AlbumId
JOIN media_types m ON t.MediaTypeId = t.MediaTypeId
"""

pd.read_sql_query(query6,connection).head(2)

,Song Name,Format,Album,Genre
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,For Those About To Rock (We Salute You),Protected AAC audio file,For Those About To Rock We Salute You,Rock

### 7.	Muestra cuántas canciones hay en cada playlist y el nombre de cada playlist.

In [147]:
query = """
SELECT COUNT(p.PlaylistId) as "Number of songs", p.Name as "Playlist Name"
FROM playlists p
JOIN playlist_track pt ON p.PlaylistId = pt.PlaylistId
GROUP BY p.PlaylistId
"""

pd.read_sql_query(query,connection)

    Number of songs               Playlist Name
0              3290                       Music
1               213                    TV Shows
2              1477                  90’s Music
3              3290                       Music
4                 1                Music Videos
5               213                    TV Shows
6                39             Brazilian Music
7                75                   Classical
8                25   Classical 101 - Deep Cuts
9                25  Classical 101 - Next Steps
10               25  Classical 101 - The Basics
11               15                      Grunge
12               26         Heavy Metal Classic
13                1                 On-The-Go 1

### 8.	Muestra cuánto ha vendido cada empleado.

In [151]:
query8 = """
SELECT SUM(i.Total) as "Total sales" ,e.FirstName||" "||e.LastName as "Employee"
FROM employees e
JOIN customers c ON c.SupportRepId = e.employeeId
JOIN invoices i ON i.CustomerId = c.CustomerId
GROUP BY e.EmployeeId

"""

pd.read_sql_query(query8,connection)

   Total sales       Employee
0       833.04   Jane Peacock
1       775.40  Margaret Park
2       720.16  Steve Johnson

### 9.	¿Quién ha sido el agente de ventas que más ha vendido en 2009?

In [160]:
query9 = """
SELECT SUM(i.Total) as "Sales", e.FirstName||" "||e.LastName as "Employee"
FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON i.CustomerId = c.CustomerId
WHERE i.InvoiceDate LIKE "2009%"
GROUP BY e.EmployeeId
ORDER BY Sales DESC
LIMIT 1

"""
pd.read_sql_query(query9,connection)

    Sales       Employee
0  164.34  Steve Johnson

### 10.	¿Cuáles son los 3 grupos que más han vendido?

In [166]:
# Si entiendo que los grupos son los compositores
query="""
SELECT SUM(i.Quantity) as "Quantity", t.Composer as "Artist"
FROM tracks t
JOIN invoice_items i ON t.TrackId = i.TrackId
GROUP BY t.Composer
ORDER BY SUM(i.Quantity) DESC
LIMIT 3
"""

pd.read_sql_query(query,connection)

   Quantity        Artist
0       596          None
1        58  Steve Harris
2        33            U2

In [155]:
# Si entiendo que los grupos son los artistas
query10= """
SELECT SUM(i.Quantity) as "Quantity", a.Name as "Artist"
FROM artists a
JOIN albums al ON al.AlbumId == a.ArtistId
JOIN tracks t ON al.AlbumId == t.AlbumId
JOIN invoice_items i ON t.TrackId == i.TrackId
GROUP BY a.Name
ORDER BY SUM(i.Quantity) DESC
LIMIT 3
"""

pd.read_sql_query(query10,connection)

   Quantity                           Artist
0        27  Frank Zappa & Captain Beefheart
1        26                       The Police
2        25         Vinícius E Qurteto Em Cy

### 11. Muestra cuántas canciones de Rock hay en cada playlist

In [185]:
query11= """
SELECT p.Name as "Genre", COUNT(p.PlaylistId) as "Number of songs"
FROM genres g
JOIN tracks t ON t.GenreId = g.GenreId
JOIN playlist_track pt ON pt.TrackId == t.TrackId
JOIN playlists p ON pt.PlaylistId == p.PlaylistId
WHERE g.Name = "Rock"
GROUP BY p.PlaylistId

"""

pd.read_sql_query(query11,connection)

                 Genre  Number of songs
0                Music             1297
1           90’s Music              621
2                Music             1297
3               Grunge               14
4  Heavy Metal Classic                9

### 12. Muestra una tabla con todas canciones y su(s) Id de factura, hayan sido vendidas alguna vez o no.

In [194]:
query12= """
SELECT t.Name as "Song's Name", it.InvoiceId as "Invoice Id"
FROM tracks t
LEFT JOIN Invoice_Items it ON it.TrackId == t.TrackId

"""
pd.read_sql_query(query12,connection)

                                            Song's Name  Invoice Id
0               For Those About To Rock (We Salute You)       108.0
1                                     Balls to the Wall         1.0
2                                     Balls to the Wall       214.0
3                                       Fast As a Shark       319.0
4                                     Restless and Wild         1.0
...                                                 ...         ...
3754  String Quartet No. 12 in C Minor, D. 703 "Quar...       108.0
3755  String Quartet No. 12 in C Minor, D. 703 "Quar...       319.0
3756               L'orfeo, Act 3, Sinfonia (Orchestra)         NaN
3757  Quintet for Horn, Violin, 2 Violas, and Cello ...         NaN
3758                                      Koyaanisqatsi         NaN

[3759 rows x 2 columns]

### 13. ¿Cuántos artistas no tienen ningún album?

In [153]:
# Es una left join como en pandas. Quiero comparar la informacion con una columna
query13 = """
SELECT COUNT(*) as "Artists without album"
FROM artists a
LEFT JOIN albums al ON al.ArtistId == a.ArtistId
WHERE al.Title IS NULL
"""

pd.read_sql_query(query13,connection)

   Artists without album
0                     71

![imagen](./img/chinook_data_model.png)

In [ ]:
# Por convención, siempre ponder dos iguales cuando comparo los join

In [ ]:
#ESCAPE ROOM

In [ ]:
Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr"(Morty Schapiro, 14887	). The second witness, named Annabel Miller(16371), lives somewhere on "Franklin Ave".

In [ ]:
I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".

In [ ]:
I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.

In [ ]:
XTE42	20180109	486	1124

6LSTG	20180109	399	515

GE5Q8	20180109	367	959

48Z7A	20180109	1600	1730

48Z55	20180109	1530	1700

90081	20180109	1600	1700

In [ ]:
48Z7A	28819	Joe Germuska	20160305	gold    28819   173289

In [ ]:
48Z55	67318	Jeremy Bowers	20160101	gold

67318	Jeremy Bowers	423327	530	Washington Pl, Apt 3A	871539279

In [ ]:
Congrats, you found the murderer! But wait, there's more... If you think you're up for a challenge, try querying the interview transcript of the murderer to find the real villain behind this crime. If you feel especially confident in your SQL skills, try to complete this final step with no more than 2 queries. Use this same INSERT statement with your new suspect to check your answer.

In [ ]:
I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5" (65") or 5'7" (67"). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.

In [ ]:
id	age	height	eye_color	hair_color	gender	plate_number	car_make	car_model
202298	68	66	green	red	female	500123	Tesla	Model S
291182	65	66	blue	red	female	08CM64	Tesla	Model S
918773	48	65	black	red	female	917UU3	Tesla	Model S

In [ ]:
99716	Miranda Priestly	202298	1883	Golden Ave	987756388
90700	Regina George	291182	332	Maple Ave	337169072
78881	Red Korb	918773	107	Camerata Dr	961388910

### Ultimo dia de SQL con Clara

In [ ]:
# Funciones de ventana suele ser pregunta de entrevista a pillar, subqueries (asociarlo a subconsulta),

In [ ]:
# Repasar video de la clase para la teoría